#+TITLE:  Homework 5
#+AUTHOR: Yusheng Zhao

* Problem 1
    #+begin_src julia :exports both :results output
begin
    using SparseArrays
    colindices = [1; 2; 3; 3; 4]
    rowindices = [3; 1; 1; 4; 5]
    m,n = 5,5
    data = [0.799; 0.942; 0.848; 0.164; 0.637]
    sp = sparse(rowindices, colindices, data,m,n);
    @assert sp.colptr == [1; 2; 3; 5; 6; 6]
    @assert sp.rowval == [3; 1; 1; 4; 5]
    @assert sp.nzval == [0.799; 0.942; 0.848; 0.164; 0.637]
    @assert sp.m == 5
    @assert sp.n == 5
    println("Yeah, everything works!")
end
    #+end_src

    #+RESULTS:
    : Yeah, everything works!


* Problem 2
** Section A
-
** Section B
